{"id":"37b024d0-d8cd-11ee-b6e4-51705e44af09","updated_at":"2024-03-02T19:49:10.090Z","updated_by":"elastic","created_at":"2024-03-02T19:44:00.941Z","created_by":"elastic","name":"Hosts File Modified [Duplicate]","tags":["Domain: Endpoint","OS: Linux","OS: Windows","OS: macOS","Use Case: Threat Detection","Tactic: Impact","Resources: Investigation Guide","Data Source: Elastic Defend"],"interval":"10m","enabled":true,"revision":1,"description":"The hosts file on endpoints is used to control manual IP address to hostname resolutions. The hosts file is the first point of lookup for DNS hostname resolution so if adversaries can modify the endpoint hosts file, they can route traffic to malicious infrastructure. This rule detects modifications to the hosts file on Microsoft Windows, Linux (Ubuntu or RHEL) and macOS systems.","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n### Investigating Hosts File Modified\n\nOperating systems use the hosts file to map a connection between an IP address and domain names before going to domain name servers. Attackers can abuse this mechanism to route traffic to malicious infrastructure or disrupt security that depends on server communications. For example, Russian threat actors modified this file on a domain controller to redirect Duo MFA calls to localhost instead of the Duo server, which prevented the MFA service from contacting its server to validate MFA login. This effectively disabled MFA for active domain accounts because the default policy of Duo for Windows is to \"Fail open\" if the MFA server is unreachable. This can happen in any MFA implementation and is not exclusive to Duo. Find more details in this [CISA Alert](https://www.cisa.gov/uscert/ncas/alerts/aa22-074a).\n\nThis rule identifies modifications in the hosts file across multiple operating systems using process creation events for Linux and file events in Windows and macOS.\n\n#### Possible investigation steps\n\n- Identify the specifics of the involved assets, such as role, criticality, and associated users.\n- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.\n- Identify the user account that performed the action and whether it should perform this kind of action.\n- Contact the account owner and confirm whether they are aware of this activity.\n- Investigate other alerts associated with the user/host during the past 48 hours.\n- Examine the changes to the hosts file by comparing it against file backups, volume shadow copies, and other restoration mechanisms.\n\n### False positive analysis\n\n- This mechanism can be used legitimately. Analysts can dismiss the alert if the administrator is aware of the activity and the configuration was justified.\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Consider isolating the involved host to prevent further post-compromise behavior.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.\n- Review the privileges of the administrator account that performed the action.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n\n","license":"Elastic License v2","output_index":"","timeline_id":"4d4c0b59-ea83-483f-b8c1-8c360ee53c5c","timeline_title":"Comprehensive File Timeline","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-840s","rule_id":"03e8c539-1d46-4688-ba8c-d050782915a6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0040","name":"Impact","reference":"https://attack.mitre.org/tactics/TA0040/"},"technique":[{"id":"T1565","name":"Data Manipulation","reference":"https://attack.mitre.org/techniques/T1565/","subtechnique":[{"id":"T1565.001","name":"Stored Data Manipulation","reference":"https://attack.mitre.org/techniques/T1565/001/"}]}]}],"to":"now","references":["https://www.elastic.co/guide/en/beats/auditbeat/current/auditbeat-reference-yml.html"],"version":107,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["auditbeat-*","winlogbeat-*","logs-endpoint.events.*","logs-windows.*"],"query":"any where\n\n  /* file events for creation; file change events are not captured by some of the included sources for linux and so may\n     miss this, which is the purpose of the process + command line args logic below */\n  (\n   event.category == \"file\" and event.type in (\"change\", \"creation\") and\n     file.path : (\"/private/etc/hosts\", \"/etc/hosts\", \"?:\\\\Windows\\\\System32\\\\drivers\\\\etc\\\\hosts\") and \n     not process.name in (\"dockerd\", \"rootlesskit\", \"podman\", \"crio\")\n  )\n  or\n\n  /* process events for change targeting linux only */\n  (\n   event.category == \"process\" and event.type in (\"start\") and\n     process.name in (\"nano\", \"vim\", \"vi\", \"emacs\", \"echo\", \"sed\") and\n     process.args : (\"/etc/hosts\") and \n     not process.parent.name in (\"dhclient-script\", \"google_set_hostname\")\n  )\n","filters":[],"actions":[{"group":"default","id":"446e2d20-c554-11ee-a7fc-855e12ead1d4","params":{"documents":[{"context_alerts":"[{{context.alerts}}]","name":"{{context.rule.name}}","alert_type":"host_file","link":"{{rule.url}}","email_intro":"Host files modified on these machines","query":"{{context.rule.query}}","params":"{{rule.params}}","rule_date":"{{date}}"}]},"action_type_id":".index","uuid":"ca957ae4-eeaf-44ed-9355-87e650de746f","frequency":{"notifyWhen":"onActiveAlert","throttle":null,"summary":true}}]}
{"id":"446e2d20-c554-11ee-a7fc-855e12ead1d4","type":"action","updated_at":"2024-03-02T02:04:40.248Z","created_at":"2024-03-02T02:04:40.248Z","version":"WzE5MjIsNV0=","attributes":{"actionTypeId":".index","config":{"executionTimeField":null,"index":"alerts-siem","refresh":false},"isMissingSecrets":false,"name":"alerts-siem","secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.3.0"}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
