{"id":"36588410-d8cd-11ee-b6e4-51705e44af09","updated_at":"2024-03-02T19:48:39.805Z","updated_by":"elastic","created_at":"2024-03-02T19:43:58.789Z","created_by":"elastic","name":"Sudoers File Modification [Duplicate]","tags":["Domain: Endpoint","OS: Linux","OS: macOS","Use Case: Threat Detection","Tactic: Privilege Escalation","Data Source: Elastic Defend"],"interval":"10m","enabled":true,"revision":1,"description":"A sudoers file specifies the commands that users or groups can run and from which terminals. Adversaries can take advantage of these configurations to execute commands as other users or spawn processes with higher privileges.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"4m","kibana_siem_app_url":""},"timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"author":["Elastic"],"false_positives":[],"from":"now-840s","rule_id":"2fe13990-41d6-4b4b-a491-ddde59c5ffb8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.003","name":"Sudo and Sudo Caching","reference":"https://attack.mitre.org/techniques/T1548/003/"}]}]}],"to":"now","references":[],"version":204,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"new_terms","query":"event.category:file and event.type:change and file.path:(/etc/sudoers* or /private/etc/sudoers*) and\nnot process.name:(dpkg or platform-python or puppet or yum or dnf) and \nnot process.executable:(/opt/chef/embedded/bin/ruby or /opt/puppetlabs/puppet/bin/ruby or /usr/bin/dockerd)\n","new_terms_fields":["host.id","process.executable","file.path"],"history_window_start":"now-15m","index":["auditbeat-*","logs-endpoint.events.*"],"filters":[],"language":"kuery","actions":[{"group":"default","id":"446e2d20-c554-11ee-a7fc-855e12ead1d4","params":{"documents":[{"context_alerts":"[{{context.alerts}}]","name":"{{context.rule.name}}","alert_type":"sudoers","link":"{{rule.url}}","email_intro":"Sudoers modified on these machines","query":"{{context.rule.query}}","params":"{{rule.params}}","rule_date":"{{date}}"}]},"action_type_id":".index","uuid":"2c0a38a8-39dc-40fe-b1a9-5cf758a11366","frequency":{"notifyWhen":"onActiveAlert","throttle":null,"summary":true}}]}
{"id":"446e2d20-c554-11ee-a7fc-855e12ead1d4","type":"action","updated_at":"2024-03-02T02:04:40.248Z","created_at":"2024-03-02T02:04:40.248Z","version":"WzE5MjIsNV0=","attributes":{"actionTypeId":".index","config":{"executionTimeField":null,"index":"alerts-siem","refresh":false},"isMissingSecrets":false,"name":"alerts-siem","secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.3.0"}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
